Tekla Open API Reference for Tekla Structures 2025
View.Create3dView Method
Overload List
Name | Description
Create3dView(Drawing, Point, View.ViewAttributes, View)
 Generates a new 3d view on the sheet of the given active drawing.
Create3dView(Drawing, CoordinateSystem, CoordinateSystem, AABB, Point, View.ViewAttributes, View)
 Generates a new 3d view on the sheet of the given active drawing using given view plane and display plane.
Top
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace